const CARD_COMPANIES: Record<string, string> = {
  "3K": "기업BC",
  "46": "광주카드",
  "71": "롯데카드",
  "30": "KDB산업은행",
  "31": "BC카드",
  "51": "삼성카드",
  "38": "새마을금고",
  "41": "신한카드",
  "62": "신협",
  "36": "씨티카드",
  "33": "우리카드",
  W1: "우리카드",
  "37": "우체국",
  "39": "저축은행",
  "35": "전북은행",
  "42": "제주은행",
  "15": "카카오뱅크",
  "3A": "케이뱅크",
  "24": "토스뱅크",
  "21": "하나카드",
  "61": "현대카드",
  "11": "KB국민카드",
  "91": "NH농협카드",
  "34": "Sh수협은행",
};

export function getCardCompanyName(code: string) {
  return CARD_COMPANIES[code] || code || "-";
}
